Merge pull request #45 from revenantonthemission/main
PR: JWT 도입 & CI/CD 도입 & 코드 품질 향상
